tap 'homebrew/cask-fonts'

cask 'alacritty'
cask 'dash'
cask 'firefox'
cask 'font-jetbrains-mono'
cask 'vimr'

brew 'ack'
brew 'boost' # Used for vim cpsm
brew 'coreutils'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ["HEAD"]
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'less'
brew 'lua'
brew 'neovim'
brew 'npm'
brew 'python3'
brew 'rbenv'
brew 'renameutils'
brew 'ripgrep'
brew 'gnu-sed'
brew 'shellcheck'
brew 'stow'
brew 'swiftformat'
brew 'swiftlint'
brew 'wget'
brew 'yamllint'
brew 'zsh'
