tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'

# Third party taps
tap 'robotsandpencils/made'

brew 'ack'
brew 'aria2' # Faster downloads for xcodes
brew 'bat'
brew 'boost' # Used for vim cpsm
brew 'coreutils'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'gnu-sed'
brew 'gpg'
brew 'jq'
brew 'just'
brew 'less'
brew 'lua'
brew 'lua-language-server'
brew 'luarocks'
brew 'mas'
brew 'neovim'
brew 'npm'
brew 'pinentry-mac' # used for gpg
brew 'python3'
brew 'rbenv'
brew 'renameutils'
brew 'ripgrep'
brew 'shellcheck'
brew 'shfmt'
brew 'stow'
brew 'stylua'
brew 'swift-sh'
brew 'swiftformat'
brew 'swiftlint'
brew 'tealdeer'
brew 'universal-ctags'
brew 'wget'
brew 'xcbeautify'
brew 'xcodes'
brew 'yamllint'
brew 'zsh'

cask 'dash'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-sf-compact'
cask 'font-sf-mono'
cask 'font-sf-pro'
cask 'intellij-idea-ce' # only as mergetool
cask 'kitty'
cask 'tower'
cask 'xcodes'

mas 'Things', id: 904280696
mas 'Vimari', id: 1480933944
