tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'

# Third party taps
tap 'robotsandpencils/made'

brew 'ack'
brew 'aria2' # Faster downloads for xcodes
brew 'bat'
brew 'boost' # Used for vim cpsm
brew 'coreutils'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'gnu-sed'
brew 'jq'
brew 'less'
brew 'lua'
brew 'mas'
brew 'neovim'
brew 'ninja' # Used for sumneko/lua-language-server
brew 'npm'
brew 'python3'
brew 'rbenv'
brew 'renameutils'
brew 'ripgrep'
brew 'shellcheck'
brew 'shfmt'
brew 'stow'
brew 'stylua'
brew 'swift-sh'
brew 'swiftformat'
brew 'swiftlint'
brew 'universal-ctags'
brew 'wget'
brew 'xcodes'
brew 'yamllint'
brew 'zsh'

cask 'alacritty'
cask 'dash'
cask 'font-jetbrains-mono'
cask 'vimr'

mas 'Vimari', id: 1480933944
